#ifndef __HR_OBCON3_H
#define __HR_OBCON3_H

#include "common.h"

typedef struct HRPT_EFC { // 0x40
    /* 0x00 */ sceVu0FVECTOR pos;
    /* 0x10 */ sceVu0FVECTOR rot;
    /* 0x20 */ s32 id;
    /* 0x24 */ void (*draw)(struct HRPT_EFC *);
    /* 0x28 */ void (*work)(struct HRPT_EFC *);
    /* 0x2c */ s32 bun;
    /* 0x30 */ s32 reg0;
    /* 0x34 */ s32 reg1;
    /* 0x38 */ s32 reg2;
    /* 0x3c */ s32 reg3;
} HRPT_EFC;

#ifdef KL2_VER_TRIAL
typedef enum {
    PTEFC_NON,
    PT0100_LTBALL,
    PT0100_RINGLT,
    PT0104_RINGOUT,
    PT0706_SWON,
    PT0706_SWOFF,
    PT0706_SMOKE,
    PT0706_JOUKI,
    PT0706_LTOFF0,
    PT0706_LTOFF1,
    PT0706_LTOFF2,
    PT0706_AWAN,
    PT0706_AWAB,
    PT0706_AWAN1,
    PT0706_AWAB1,
    PT0706_AWAN2,
    PT0706_AWAB2,
    PT4002_ZANZ,
    PT4002_ENGI,
    PTOPEN_HIKA0,
    PTOPEN_HIKA1,
    PTOPEN_HIKA2,
    PTOPEN_HIKA3,
    PT0104_KANE,
    PT0207_LIGHT,
    PT0207_HANE,
    PT2100_SMOKE,
    PT2100_BOSS0,
    PT2100_BOSS1,
    PT2100_KDAMA,
    PT2100_ELEM,
    PT040A_SMOKE,
    PT4004_SPAK,
    PT4004_FIRE,
    PT4004_SMOKE,
    PT4001_ECOL0,
    PT4001_ECOL1,
    PT4001_ECOL2,
    PT4001_ECOL3,
    PT1306_RSHOT,
    PT1306_KIRA,
    PT1306_HAKK,
    PT1305_HIKW,
    PT1305_SITW,
    PT1400_YURA,
    PT2600_FLUSH0,
    PT2600_FLUSH1,
    PT2600_FLUSH2,
    PT2600_FLUSH3,
    PT2600_BFOG,
    PT1404_MOYA,
    PT1505_BAKUH,
    PT1505_SMOKE,
    PT1500_SMOKE,
    PT2700_POWUP,
    PT2700_BARI,
    PT2700_FUJN,
    PTEND_HAMON,
    PTEND_KIER,
    PTEND_ASAHI,
    PT2300_BOSS0,
    PTOPEN_RAKKA,
    PT1111_MIRR,
    PT1111_MIRRF,
    PT4004_AWA,
    PT2301_BOSS1,
    PT2301_BOSS2,
    PT2301_REOSHOT,
    PT1306_HANET,
    PT1306_HANEH,
    PT1502_BAKUH,
    PTEFC_NUM
} PTEFC;
#else
typedef enum {
    PTEFC_NON,
    PT0100_LTBALL,
    PT0100_RINGLT,
    PT0104_RINGOUT,
    PT0706_SWON,
    PT0706_SWOFF,
    PT0706_SMOKE,
    PT0706_JOUKI,
    PT0706_LTOFF0,
    PT0706_LTOFF1,
    PT0706_LTOFF2,
    PT0706_AWAN,
    PT0706_AWAB,
    PT0706_AWAN1,
    PT0706_AWAB1,
    PT0706_AWAN2,
    PT0706_AWAB2,
    PT4002_ZANZ,
    PT4002_ENGI,
    PTOPEN_HIKA0,
    PTOPEN_HIKA1,
    PTOPEN_HIKA2,
    PTOPEN_HIKA3,
    PT0104_KANE,
    PT0207_LIGHT,
    PT0207_HANE,
    PT2100_SMOKE,
    PT2100_BOSS0,
    PT2100_BOSS1,
    PT2100_KDAMA,
    PT2100_ELEM,
    PT040A_SMOKE,
    PT4004_SPAK,
    PT4004_FIRE,
    PT4004_SMOKE,
    PT4001_ECOL0,
    PT4001_ECOL1,
    PT4001_ECOL2,
    PT4001_ECOL3,
    PT1306_RSHOT,
    PT1306_KIRA,
    PT1306_HAKK,
    PT1305_HIKW,
    PT1305_SITW,
    PT1400_YURA,
    PT2600_FLUSH0,
    PT2600_FLUSH1,
    PT2600_FLUSH2,
    PT2600_FLUSH3,
    PT2600_BFOG,
    PT1404_MOYA,
    PT1505_BAKUH,
    PT1505_SMOKE,
    PT1500_SMOKE,
    PT2700_POWUP,
    PT2700_BARI,
    PT2700_FUJN,
    PTEND_HAMON,
    PTEND_KIER,
    PTEND_ASAHI,
    PT2300_BOSS0,
    PTOPEN_RAKKA,
    PT1111_MIRR,
    PT1111_MIRRF,
    PT4004_AWA,
    PT2301_BOSS1,
    PT2301_BOSS2,
    PT2301_REOSHOT,
    PT1306_HANET,
    PT1306_HANEH,
    PT1502_BAKUH,
    PT0801_BOSS2,
    PT0801_BOSS4,
    PT0801_BOSS7,
    PT0801_BOSS8,
    PT2700_REOSHOT,
    PT1306_KIRA6,
    PT1306_KIRA7,
    PT1306_KIRA8,
    PT1306_KIRA9,
    PT0805_BOSS3,
    PT0805_BOSS4,
    PT0805_BOSS6,
    PT0805_TSMOKE,
    PT0805_RSMOKE,
    PT2400_SMOKE,
    PT2400_BOSS0,
    PT1208_HASIRA,
    PT2200_ELEM,
    PT2300_ELEM,
    PT2400_ELEM,
    PT3901_HAMON0,
    PT3901_HAMON1,
    PT3901_HAMON2,
    PT3901_HAMON3,
    PT3901_HAMON4,
    PT3901_HAMON5,
    PT3901_HAMON6,
    PT3901_HAMON7,
    PT1207_SEPIA,
    PT1111_MONO,
    PT2601_MOYA,
    PT2100_ELEMS,
    PT2200_ELEMS,
    PT2300_ELEMS,
    PT2400_ELEMS,
    PT0207_VISI,
    PT2601_ATAMA,
    PT2700_ELEM,
    PT2700_ELEMS,
    PT2100_WALL,
    PT2301_AWA0,
    PT2301_AWA1,
    PT2301_AWA2,
    PT2301_GRA0,
    PT2301_GRA1,
    PT2301_GRA2,
    PT2600_FLUSH0S,
    PT2600_FLUSH1S,
    PT2600_FLUSH2S,
    PT2600_FLUSH3S,
    PT0605_YUKA,
    PT0605_YUKAD,
    PT1500_SMOKE1,
    PT1500_SMOKE2,
    PT1500_SMOKE3,
    PT1500_SMOKE4,
    PT1500_SMOKE5,
    PT2701_SCROLL,
    PT1208_HASIRA1,
    PT1208_HASIRA2,
    PT1208_HASIRA3,
    PT1507_BAKUH,
    PTTITLE_KUMO,
    PT0105_HAMON,
    PT2100_BOSS2,
    PT2100_BOSS3,
    PT0100_SIBUKI0,
    PT0100_SIBUKI1,
    PT2301_SMOKE,
    PT2301_MERA0,
    PT2301_MERA1,
    PT2700_KDAMA,
    PT0706_SWLON,
    PT0806_SWBOU,
    PTEFC_NUM
} PTEFC;
#endif

extern void hr_ptefc_set(OBJWORK *objw);
extern void hr_ptefc_erase(s32 *ptr);
extern void hr_ptefc_work(OBJWORK *objw);
extern s32 hr_ptes_ON(s32 *ptr, s32 id, sceVu0FVECTOR pos, sceVu0FVECTOR rot);
extern s32 hr_ptes_WORK(s32 *ptr, s32 id, sceVu0FVECTOR pos, sceVu0FVECTOR rot);
extern s32 hr_ptes_DEL(s32 *ptr, s32 id);

#endif
